W4D4/music_project/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @band = Band.find(params[:band_id])

INSERT INTO "albums" ("band_id", "title", "yr") VALUES ($1, $2, $3) RETURNING "id"  [["band_id", 1], ["title", "Slip Stitch & Pass"], ["yr", 2001]]
---
    def create
        @album = Album.new(album_params)
        if @album.save

SELECT  "bands".* FROM "bands" LIMIT $1  [["LIMIT", 1]]
---
    def new
        @album = Album.new
        @bands = Band.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def update
        @album = Album.find(params[:id])